from lobe import ImageModel
import os
import shutil
import random
from PIL import Image
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
import streamlit as st
from datetime import datetime
import time
import torch


model = ImageModel.load(r'model/')



def imageInput(device, src):
    
    if src == 'อัปโหลดรูปภาพ':
        image_file = st.file_uploader("ตรวจสอบรูปภาพ", type=['png', 'jpeg', 'jpg'])
        col1, col2 = st.columns(2)
        if image_file is not None:
            img = Image.open(image_file)
            with col1:
                st.image(img, caption='รูปภาพที่นำเข้ามา', use_column_width='always')
            ts = datetime.timestamp(datetime.now())
            imgpath = os.path.join('data/uploads', str(ts)+image_file.name)
            outputpath = os.path.join('data/outputs', os.path.basename(imgpath))
            with open(imgpath, mode="wb") as f:
                f.write(image_file.getbuffer())

            #call Model prediction--
            
            img = mpimg.imread('./{}'.format(imgpath))
            imgplot = plt.imshow(img)
            plt.axis('off')
            plt.show()
            img = Image.open('./{}'.format(imgpath))
            img = img.resize((160, 160), Image.ANTIALIAS)
            result = model.predict(img)
            # Print top prediction
            prediction = result.prediction
            print('Model Prediction : {}'.format(prediction))
            print(prediction)
            if (prediction == "APPLE ROT LEAVES"):
                st.title("โรคใบเน่า")
                st.header("สาเหตุของโรค")
                st.write("สาเหตุเกิดจากเชื้อราหลายชนิดเช่น Phytophthora spp. Sclerotium spp. หรือเห็ดราใน Class Ascomycetesและ Basidiomycetes โรคนี้ระบาดมากในฤดูฝน หรือสภาพที่มีความชื้นสูงแพร่ระบาดโดยสปอร์เชื้อราโดยเฉพาะต้นไม้ที่ปลูกในบริเวณที่ชื้นแฉะตลอดเวลา")
                st.header("วิธีการป้องกัน")
                st.write("1.ควรเลือกใช้ดินและวัสดุปลูก ที่ค่อนข้างสะอาด ระบายน้ำได้ดี \n2.ในการเพาะกล้า ไม่ควรใส่เมล็ดในวัสดุเพาะจนลึกเกินไป \n3.ไม่ควรเพาะกล้าหนาแน่นเกินไป \n4.ควรเลือกบริเวณเพาะกล้าที่มีสภาพอากาศโปร่ง อากาศระบายได้ดี ไม่มีความชื้นสูง \n5.ไม่ควรรดน้ำมากเกินไป โดยเฉพาะในช่วงฤดูฝน")
                st.header("แนวทางการรักษา")
                st.write("ตลอดทั้งปีมีการตรวจสอบอุบัติการณ์ของโรคเน่าโดยเฉพาะอย่างยิ่งในระยะแรกของโรคต้นเน่าและต้นฤดูใบไม้ร่วง พบว่ารอยโรคเน่าหายได้ในเวลาและรอยโรคที่พัฒนาให้กับ xylem นั้นจะถูกขูดให้เป็นรูปไข่และสร้างขึ้นตามความหนาของลำต้น มันจำเป็นต้องมีพื้นผิวที่ขูดอยู่เกินขอบเขตของจุดที่เป็นโรคและการขูดแนวนอนคือ 1 ซม. และการขูดตามยาวคือ 3 ซม; สำหรับรอยโรคที่เกิดขึ้นเฉพาะในต้นฟลอกมนั้นเนื้อเยื่อที่ถูกเปลี่ยนสีจะถูกคัดลอกออกไป ใช้ยาในเวลาหลังจากการขูด สามารถเลือกใช้สารสเมียร์จากกลุ่มที่ประกอบด้วยกรดเอสเทอร์, สารละลายไทโอฟาเนทเมธิลและโซเดียมฮิเมต ตัวแทนจะต้องใช้อย่างต่อเนื่อง 2-3 ครั้งในช่วง 10-15 วันเพื่อป้องกันการกำเริบของโรคจุด")
            elif (prediction == "SCAB LEAVES"):
                st.title("โรคใบไหม้")
                st.header("สาเหตุของโรค")
                st.write("เกิดจากเชื้อแบคทีเรีย Xanthomonas campestris. ลักษณะอาการ : ระยะกล้าเชื้อแบคทีเรียที่ติดมากับเมล็ดจะติดต่อไปยังต้นกล้าและใบเลี้ยง ทำให้ใบเลี้ยงไหม้ลามไปถึงยอดหรือตากำเนิดใบ ต้นกล้าฝ้ายจะเน่าและตายในที่สุด")
                st.header("วิธีการป้องกัน")
                st.write("1. ใช้พันธุ์ต้านทาน พันธุ์ที่แนะนำในปัจจุบัน มีความต้านทานต่อโรคปานกลาง  \n2. ใช้ท่อนพันธุ์ที่ปราศจากเชื้อ\n3. ปลูกพืชอายุสั้นเป็นพืชหมุนเวียน หรือหลีกเลี่ยงการปลูกมันสำปะหลังในแปลงที่ระบาดรุนแรงนาน 6 เดือน")
                st.header("แนวทางการรักษา")
                st.write("ถึงเราจะป้องกันอย่างดีแล้วก็ยังมีโอกาสที่โรคใบไหม้จะเกิดขึ้นได้อีก แต่มันจะไม่รุนแรงเท่ากับพืชที่ขาดการป้องกัน ทันทีที่เห็นสัญญาณของโรคใบไหม้ ให้ตัดส่วนใบนั้นทิ้ง แล้วนำไปเผาหรือตากทิ้งไว้กลางแดด จากนั้นคอยเฝ้าสังเกตอาการต้นพืชที่มีปัญหาเป็นระยะๆ ถ้าต้นพืชมีความเสียหายหนักมากจนต้องถอนออก ก่อนจะปลูกต้นใหม่ต้องมีการใช้สารกำจัดเชื้อราในแปลงปลูกให้เรียบร้อย")
            elif (prediction == "HEALTHY LEAVES"):
                st.title("ใบสุขภาพดี")
            elif (prediction == "LEAF BLOTCH"):
                st.title("โรคใบจุด")
                st.header("สาเหตุของโรค")
                st.write("เกิดมาจาก เชื้อ ราที่มีชื่อว่า Alternaria brassicicola มักระบาดในช่วงหน้าฝน สำหรับคนที่ทำการเพาะปลูก แล้ว แทบจะต้องเจอทุกคน ถ้าหาก ไม่มีการป้องกันเชื้อราและความชื้นสูงที่มากับหน้าฝน ที่ดีพอ และถ้าหาก ปล่อยไว้ ไม่จัดการ หรือรักษา โรคใบจุดอาจะลุกลาม จนทำให้ผลผลิตของคุณเสียหายหนัก")  
                st.header("วิธีการป้องกัน")
                st.write("1.ใช้เมล็ดพันธุ์ที่ปลอดโรค หรือฆ่าเชื้อที่อาจติดมากับเมล็ด โดยแช่ในน้ำอุ่น 49-50 องศาเซลเซียส นาน 20-25 นาที \n2.หลีกเลี่ยงการปลูกผักกาดหรือกะหล่ำต่างๆ ลงในดินที่เคยปลูกและมีโรคระบาดมาก่อนอย่างน้อย 3-4 ปี")
                st.header("แนวทางการรักษา")
                st.write("เราควรที่จะแยกต้นที่มีราจุดกับต้นอื่นไว้เพื่อไม่ให้ลุกลามแต่ถ้าในกรณีที่ลุกลามไปทั้งแปลงก็ควรที่จะกำจัดและทำความสะอาดแปลงทั้งหมดครับ")
            # Print all classes
          
               
            #--Display predicton
            #++++++++++++++++++++++++++++++++++++++
            # img_ = Image.open(outputpath)
            # with col2:
            #     st.image(img_, caption='ผลลัพธ์จากการตรวจสอบ', use_column_width='always')


def main():
    # -- Sidebar
    st.sidebar.title('🌿 Ai Health Check Apple Leaf')
    datasrc = st.sidebar.radio("เลือกประเภทรูปแบบการนำเข้า", ['อัปโหลดรูปภาพ'])
        
                
    option = st.sidebar.radio("ระบุประเภทข้อมูล", ['Image'], disabled = False)
    if torch.cuda.is_available():
        deviceoption = st.sidebar.radio("ประมวลผลโดยใช้", ['cpu', 'cuda'], disabled = False, index=1)
    else:
        deviceoption = st.sidebar.radio("ประมวลผลโดยใช้", ['cpu', 'cuda'], disabled = True, index=0)
    # -- End of Sidebar

    st.header('Ai Health Check Apple Leaf')
    
    if option == "Image":    
        imageInput(deviceoption, datasrc)

    st.text(" \n")
    st.text(" \n")
    st.text(" \n")
    st.text(" \n")
    st.text(" \n")
    st.text(" \n")
    st.text(" \n")
    st.text(" \n")
    st.text(" \n")   
    st.markdown('ซอฟต์แวร์นี้เป็นผลงานที่พัฒนาขึ้นโดย  นายพลกฤต กระจายศรี และ คณะผู้จัดทำจาก โรงเรียนกสิณธรเซนต์ปีเตอร์ ภายใต้การดูแลของ นางสาว สุขสมฤดี ปวงนิยม ภายใต้โครงการ การแข่งขันพัฒนาโปรแกรมคอมพิวเตอร์แห่งประเทศไทย ครั้งที่ 25 (NSC 2023) The 25th National Software Contest: NSC 2023 ซึ่งสนับสนุนโดย สํานักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติโดยมีวัตถุประสงค์เพื่อส่งเสริมให้นักเรียนและนักศึกษาได้เรียนรู้และฝึกทักษะในการพัฒนาซอฟต์แวร์ ลิขสิทธิ์ของซอฟต์แวร์นี้จึงเป็นของผู้พัฒนา ซึ่งผู้พัฒนาได้อนุญาตให้สานักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ เผยแพร่ซอฟต์แวร์นี้ตาม “ต้นฉบับ” โดยไม่มีการแก้ไขดัดแปลงใด ๆ ทั้งสิ้น ให้แก่บุคคลทั่วไปได้ใช้เพื่อประโยชน์ส่วนบุคคลหรือประโยชน์ทางการศึกษาที่ไม่มีวัตถุประสงค์ในเชิงพาณิชย์โดยไม่คิดค่าตอบแทนการใช้ซอฟต์แวร์ ดังนั้น สํานักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ จึงไม่มีหน้าที่ในการดูแล บารุงรักษา จัดการอบรมการใช้งานหรือพัฒนาประสิทธิภาพซอฟต์แวร์ รวมทั้งไม่รับรองความถูกต้องหรือประสิทธิภาพการทางานของซอฟต์แวร์ ตลอดจนไม่รับประกันความเสียหายต่าง ๆ อันเกิดจากการใช้ซอฟต์แวร์นี้ทั้งสิ้น')
    
if __name__ == '__main__':
  
    main()
       
